[M_Ep3_CatchARide MissionDefinition]
MissionDescription="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. You'll also find safety, comfort, and at least a few people whose primary mode of communication isn't delivered through the barrel of a gun."

[M_Ep3_CatchARide:AcquireNetworkInterfaceSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. A scuffle between a local bandit clan and one of [place]Sanctuary's[-place] gatekeepers has left you stranded on the wrong side of a broken ramp. The Guardian Angel suggested grabbing a vehicle from the nearby Catch-A-Ride station so you can jump over the destroyed ramp and drive to [place]Sanctuary[-place], but you've hit a snag: the Catch-A-Ride has locked you out. Good news: Angel can hack it for you. Bad news: since the Catch-A-Ride isn't Hyperion tech, she'll need a Hyperion adapter to interface with it. Good news: there is a Hyperion adapter in one of the nearby Bloodshot bandit camps. The Angel has asked you to retrieve it."

[M_Ep3_CatchARide:DeliverPowerSupplySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. You've made it past [place]Sanctuary's[-place] outer gate. Before the gatekeeper can let you in, however, you'll have to install the power core you found into [place]Sanctuary's[-place] shield generator. So, you know. Do that."

[M_Ep3_CatchARide:FindECHOSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. Upon attempting to enter the city, you were contacted by Roland, the leader of the Crimson Raider resistance. He informed you that Corporal Reiss, a friend of his, was out trying to find a new power core for [place]Sanctuary's[-place] shield. Roland says that his men will let you into [place]Sanctuary[place] once you find Reiss and the core."

[M_Ep3_CatchARide:GetPowerSupplySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. Upon attempting to enter the city, you were contacted by Roland, the leader of the Crimson Raider resistance. He informed you that Corporal Reiss, a friend of his, was out trying to find a new power core for [place]Sanctuary's[place] shield. You found Reiss -- with his dying breath, he told you that a group of bandits stole the power core from him. You'll have to track them down, wipe them out, and grab the core."

[M_Ep3_CatchARide:InstallNetworkInterfaceSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Attach the Hyperion adapter to the Catch-A-Ride."
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. A scuffle between the Bloodshots and one of [place]Sanctuary's[-place] gatekeepers has left you stranded on the wrong side of a broken ramp. You found a Hyperion adapter that will allow the Guardian Angel to bypass the Catch-A-Ride firewalls -- once you attach the Hyperion adapter, the Angel can hack it for you and get you a vehicle, letting you get across to the other side of the ramp."

[M_Ep3_CatchARide:InstallPowerSupplySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've made it to [place]Sanctuary[-place] and restored its shield. However, with Roland missing, the Crimson Raiders of [place]Sanctuary[-place] still need your help."

[M_Ep3_CatchARide:JumpRampSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. Now that you've got a car, it's smooth sailing to [place]Sanctuary[-place]. Probably."

[M_Ep3_CatchARide:SanctuaryOuterGate MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. Upon attempting to enter the city, you were contacted by Roland, the leader of the Crimson Raider resistance. He informed you that Corporal Reiss, a fellow Raider, was out trying to find a new power core for [place]Sanctuary's[-place] shield. You've tracked Reiss down, only to find he'd been killed by Bloodshot bandits, but you were able to recover the power core. You should head back to [place]Sanctuary's[-place] gate."

[M_Ep3_CatchARide:TalkToRolandAtGateSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. The Guardian Angel has asked you to use the intercom on [place]Sanctuary's[place] gate. Once you speak to the gatekeeper, he should let you inside."

[M_Ep3_CatchARide:UseCatchARideSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Get a vehicle from the Catch-A-Ride."
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. A scuffle between a local bandit clan and one of [place]Sanctuary's[-place] gatekeepers has left you stranded on the wrong side of a broken ramp. The Guardian Angel has suggested grabbing a vehicle from the nearby Catch-A-Ride station so you can jump over the destroyed ramp and drive to [place]Sanctuary[-place]."

[M_Ep3_CatchARide:UseCatchARideUnlocked MissionObjectiveSetDefinition]
MissionSummaryOverride="Get a car from the Catch-A-Ride."
MissionDescriptionOverride="[place]Sanctuary[-place]. The last free city on Pandora. Within its walls, you will find Roland, the leader of the resistance against Handsome Jack. A scuffle between the Bloodshot bandits and one of [place]Sanctuary's[-place] gatekeepers has left you stranded on the wrong side of a broken ramp. The Guardian Angel has suggested grabbing a vehicle from the nearby Catch-A-Ride station so you can jump over the destroyed ramp and drive to [place]Sanctuary[-place]."

[M_Ep3_CatchARide:UseLockedCatchARide MissionObjectiveDefinition]
ProgressMessage="Use Catch-A-Ride"
